openmv/openmv/ports/stm32/omv_csi.c
            csi->dma_size = line_width * fb->v / 4;

            // Error out if the transfer size is not compatible with DMA transfer restrictions.
            if ((!line_width) || (line_width % 4) ||
                #if defined(OMV_LINE_BUF_SIZE)
                (line_width > (OMV_LINE_BUF_SIZE / 2)) ||
                #endif
                (!csi->dma_size) || ((line_width * fb->v) % OMV_CSI_LINE_ALIGNMENT)) {
                return OMV_CSI_ERROR_INVALID_FRAMESIZE;
            }

            #if defined(STM32N6)
            // The N6 DCMI driver currently does not support any of these modes.
            if (csi->pixformat == PIXFORMAT_JPEG || csi->transpose ||
                fb->x != 0 || fb->u != csi->resolution[csi->framesize][0]) {
                return OMV_CSI_ERROR_CAPTURE_FAILED;
            }
            #endif

            HAL_DCMI_DisableCrop(&csi->dcmi);
            if (csi->pixformat != PIXFORMAT_JPEG) {
                // Vertically crop the image. Horizontal cropping is done in software.
                HAL_DCMI_ConfigCrop(&csi->dcmi, x_crop, fb->y, line_width - 1, fb->v - 1);
                HAL_DCMI_EnableCrop(&csi->dcmi);
            }

            #if USE_MDMA
            // Configure MDMA for non-JPEG modes. MDMA will be used to either
            // completely offload the transfer, in case of non-transposed mode
            // or copy transposed lines.
            if (csi->pixformat != PIXFORMAT_JPEG) {
                stm_mdma_init(csi, bytes_per_pixel, x_crop);
            }
            #endif

            // Reset the DMA state and re-enable it.
            #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
            OMV_CSI_DMA_CHANNEL->CR &= ~(DMA_SxCR_CIRC | DMA_SxCR_CT | DMA_SxCR_DBM);
            #endif
            HAL_NVIC_EnableIRQ(csi->dma_irqn);

            // HAL_DCMI_Start_DMA and HAL_DCMI_Start_DMA_MB both perform circular transfers,
            // differing only in size, with an interrupt after every half of the transfer.
            if ((csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
                // Start a one-shot transfer to the framebuffer, used only for JPEG mode 3.
                uint32_t size = framebuffer_get_buffer_size(fb) / 4;
                csi->dma_size = IM_MIN(size, OMV_CSI_DMA_MAX_SIZE * 2U);
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
            #if USE_MDMA
            } else if ((csi->pixformat != PIXFORMAT_JPEG) && (!csi->transpose)) {
                // Special transfer mode that uses DMA in circular mode and MDMA
                // to move the lines to the final destination.
                ((DMA_Stream_TypeDef *) csi->dma.Instance)->CR |= DMA_SxCR_CIRC;
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, line_width / 4);
            #endif  // USE_MDMA
            } else {
                #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
                // Start a multibuffer (line by line) transfer.
                HAL_DCMI_Start_DMA_MB(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, csi->dma_size, fb->v);
                #else
                // Handle YUV422 Source -> Y Destination using DCMI byte drop.
                if (csi->pixformat == PIXFORMAT_GRAYSCALE && csi->mono_bpp == 2) {
                    csi->dma_size /= 2;
                }

                // Disable circular mode for transfer sizes less than 64KB.
                if (csi->dma_size * 4 <= OMV_CSI_DMA_MAX_SIZE) {
                    HAL_DMAEx_List_ClearCircularMode(&csi->dma_queue);
                } else {
                    HAL_DMAEx_List_SetCircularMode(&csi->dma_queue);
                }

                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
                #endif
            }
        }
    }

    // In JPEG mode, enable the end of frame interrupt.
    if (!csi->mipi_if && csi->pixformat == PIXFORMAT_JPEG) {
        __HAL_DCMI_ENABLE_IT(&csi->dcmi, DCMI_IT_FRAME);
    }

    // One shot DMA transfers must be invalidated.
    framebuffer_flags_t fb_flags = FB_FLAG_USED | FB_FLAG_PEEK |
                                   ((csi->one_shot) ? FB_FLAG_INVALIDATE : 0);

    // Wait for a frame to be ready.
    for (mp_uint_t start = mp_hal_ticks_ms(); ; mp_event_handle_nowait()) {
        if ((buffer = framebuffer_acquire(fb, fb_flags))) {
            break;
        }

        if (flags & OMV_CSI_FLAG_NON_BLOCK) {
            return OMV_CSI_ERROR_WOULD_BLOCK;
        }

        if ((mp_hal_ticks_ms() - start) > OMV_CSI_TIMEOUT_MS) {
            omv_csi_abort(csi, true, false);
            return OMV_CSI_ERROR_CAPTURE_TIMEOUT;
        }
    }

    // In JPEG 3 mode, the transfer must be aborted as it waits for data indefinitely.
    if (!csi->mipi_if && (csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
        omv_csi_abort(csi, false, false);
    }

    // The JPEG in the framebuffer is actually invalid.
    if (buffer->flags & VB_FLAG_OVERFLOW) {
        return OMV_CSI_ERROR_JPEG_OVERFLOW;
    }

    // Set the framebuffer width/height.
    fb->w = csi->transpose ? fb->v : fb->u;
    fb->h = csi->transpose ? fb->u : fb->v;

    // Set the framebuffer pixel format.
    switch (csi->pixformat) {
        case PIXFORMAT_GRAYSCALE:
            fb->pixfmt = PIXFORMAT_GRAYSCALE;
            break;
        case PIXFORMAT_RGB565:
            fb->pixfmt = PIXFORMAT_RGB565;
            break;
        case PIXFORMAT_BAYER:
            fb->pixfmt = PIXFORMAT_BAYER;
            fb->subfmt_id = csi->cfa_format;
            fb->pixfmt = imlib_bayer_shift(fb->pixfmt, fb->x, fb->y, csi->transpose);
            break;
        case PIXFORMAT_YUV422: {
            fb->pixfmt = PIXFORMAT_YUV;
            fb->subfmt_id = csi->yuv_format;
            fb->pixfmt = imlib_yuv_shift(fb->pixfmt, fb->x);
            break;
        }
        case PIXFORMAT_JPEG: {
            int32_t size = 0;
            if (csi->jpg_format == 4) {
                // Offset is the total frame size.
                size = buffer->offset;
            } else {
                // HAL_DCMI_Start_DMA splits bigger transfers.
                if (csi->dma_size > OMV_CSI_DMA_MAX_SIZE) {
                    csi->dma_size /= 2;
                }

                // Offset is the number of length-size transfers performed.
                size = buffer->offset * csi->dma_size * 4;
                // The DMA counter holds the number of bytes per transfer.
                if (!csi->mipi_if && __HAL_DMA_GET_COUNTER(&csi->dma)) {
                    // Add in the uncompleted transfer length.
                    size += (csi->dma_size - __HAL_DMA_GET_COUNTER(&csi->dma)) * 4;
                }
            }
            // Clean trailing data after 0xFFD9 at the end of the jpeg byte stream.
            fb->pixfmt = PIXFORMAT_JPEG;
            fb->size = jpeg_clean_trailing_bytes(size, buffer->data);
            break;
        }
        default:
            break;
    }

    #if USE_DCMIPP
    if (csi->raw_output) {
        float luminance = stm_isp_update_awb(csi, DCMIPP_PIPE, fb->u * fb->v);
        if (csi->ioctl) {
            omv_csi_ioctl(csi, OMV_CSI_IOCTL_UPDATE_AGC_AEC, fast_floorf(luminance));
        }

    }
    #endif

    // Set the user image.
    framebuffer_to_image(fb, image);
    return 0;
}

int omv_csi_ops_init(omv_csi_t *csi) {
    // Set CSI ops.
    csi->abort = stm_csi_abort;
    csi->config = stm_csi_config;
    csi->shutdown = stm_csi_shutdown;
    csi->snapshot = stm_csi_snapshot;
    csi->isp_reset = stm_csi_isp_reset;

    // Set CSI clock ops.
    csi->clk->freq = OMV_CSI_CLK_FREQUENCY;
    csi->clk->set_freq = stm_clk_set_frequency;
    csi->clk->get_freq = stm_clk_get_frequency;
    return 0;
}
